#+title: Vary Activity

* Kendryte K230
#+PLOT: title:"K230 | Varied Activity, 64+64 Neuron Network, Fan-out 50%"
#+PLOT: set:"size ratio 0.5" set:"yrange [0:*]"
#+PLOT: set:"xlabel 'Activity Percent'" set:"ylabel 'Runs per Second'" ind:1 set:"key right top" with:"lines linewidth 2" set:"xrange[1:99]"
#+PLOT: labels:("x" "risp" "vrisp" "vrisp-full")
|----------+--------------+---------------+---------------|
| N+N Size |         risp |         vrisp |    vrisp-full |
|----------+--------------+---------------+---------------|
|        / |            < |             < |             < |
|       1% | 95772.597544 | 135283.215411 | 201507.274413 |
|       3% | 52481.867515 | 116822.429907 | 172289.032080 |
|       5% | 42382.579065 | 105394.068422 | 161828.009192 |
|       7% | 33789.719816 |  95569.402500 | 152933.259925 |
|       9% | 30361.729647 |  86267.879018 | 151014.059409 |
|      11% | 27216.809101 |  80774.139352 | 142747.023725 |
|      13% | 23801.193392 |  74127.885428 | 137189.266312 |
|      15% | 21991.893788 |  68545.263865 | 130072.840791 |
|      17% | 20034.258582 |  64132.574859 | 129686.547614 |
|      19% | 17877.510449 |  60103.016570 | 124700.718276 |
|      21% | 15879.619778 |  56634.762417 | 120660.738202 |
|      23% | 15746.196506 |  52957.686808 | 115301.686864 |
|      25% | 14247.733898 |  50490.770287 | 110031.579063 |
|      27% | 13383.190178 |  47701.275532 | 107059.503672 |
|      29% | 12656.145191 |  45522.829699 | 106375.057177 |
|      31% | 12080.708799 |  43413.329629 | 103065.157793 |
|      33% | 11596.623063 |  41419.530137 | 100544.953649 |
|      35% | 10529.075516 |  39551.329716 |  98254.025959 |
|      37% | 10431.346614 |  37891.274776 |  93427.383566 |
|      39% | 10186.037794 |  36324.801848 |  91131.119455 |
|      41% |  9190.137512 |  34894.148600 |  91217.572153 |
|      43% |  9100.828995 |  33591.540306 |  87250.898684 |
|      45% |  9028.497550 |  32246.622166 |  86031.126061 |
|      47% |  8030.283806 |  31238.871152 |  83327.778148 |
|      49% |  7370.598095 |  30234.955842 |  82451.106494 |
|      51% |  7278.910376 |  29352.455480 |  80967.070692 |
|      53% |  6621.490445 |  28754.802052 |  80976.905387 |
|      55% |  6646.814846 |  27603.187616 |  79255.002972 |
|      57% |  6558.972707 |  27021.038581 |  78812.764515 |
|      59% |  6445.254971 |  26229.989797 |  78448.600477 |
|      61% |  6213.708061 |  25785.357527 |  76564.988362 |
|      63% |  6103.459746 |  25132.069023 |  76922.485212 |
|      65% |  5911.943960 |  24082.284349 |  75193.058177 |
|      67% |  5397.178355 |  23950.833729 |  73489.964945 |
|      69% |  5500.017600 |  23171.480542 |  73272.956417 |
|      71% |  5425.806438 |  22726.446311 |  71149.563497 |
|      73% |  5060.941325 |  22227.013378 |  70315.081882 |
|      75% |  5234.873049 |  21492.065130 |  69678.642103 |
|      77% |  5009.317330 |  21365.603942 |  68488.928765 |
|      79% |  5035.822322 |  20871.641492 |  65880.492786 |
|      81% |  4766.351087 |  20439.573467 |  65411.635422 |
|      83% |  4625.297696 |  20018.897840 |  61951.727214 |
|      85% |  4579.507346 |  19480.342386 |  62853.551226 |
|      87% |  4646.660933 |  19067.740053 |  61215.245045 |
|      89% |  4504.023670 |  18682.090601 |  60023.649318 |
|      91% |  4358.658300 |  18301.711027 |  58872.012245 |
|      93% |  4192.186603 |  17933.391796 |  58668.919553 |
|      95% |  4272.781187 |  17665.191623 |  56301.551108 |
|      97% |  3894.206861 |  17457.064350 |  53898.476829 |
|      99% |  3534.204562 |  17052.682557 |  55701.307310 |
|----------+--------------+---------------+---------------|

* Desktop Intel i5-12400F
#+PLOT: title:"Desktop | Varied Activity, Network 64+64, 32 Synapse Fan-out"
#+PLOT: set:"size ratio 0.5" set:"yrange [0:*]"
#+PLOT: set:"xlabel 'Activity Percent'" set:"ylabel 'Runs per Second'" ind:1 set:"key right top" with:"lines linewidth 2" set:"xrange[1:99]"
#+PLOT: labels:("x" "risp" "superneuro" "vrisp")

|------------------+---------------+----------------+------------+------------------|
| Activity Percent |          risp |          vrisp | superneuro | vrisp/superneuro |
|------------------+---------------+----------------+------------+------------------|
|                / |             < |              < |          < |                < |
|               1% | 974373.964728 | 1227144.434900 |  17.918403 |        68485.145 |
|               3% | 489524.182495 | 1027432.446317 |  18.159125 |        56579.403 |
|               5% | 493875.938364 | 1018226.249873 |  17.925226 |        56804.096 |
|               7% | 424178.154825 |  971722.864639 |  18.315882 |        53053.567 |
|               9% | 402495.471926 |  758207.597240 |  18.198370 |        41663.489 |
|              11% | 344234.079174 |  847816.871556 |  17.840070 |        47523.181 |
|              13% | 307087.581378 |  742666.171556 |  17.643490 |        42092.929 |
|              15% | 272672.738180 |  633191.920471 |  18.128939 |        34927.136 |
|              17% | 291919.663709 |  357692.170118 |  18.234780 |        19615.930 |
|              19% | 248034.327951 |  637226.789014 |  18.389497 |        34651.670 |
|              21% | 247255.464346 |  543862.511557 |  18.208546 |        29868.530 |
|              23% | 187687.687688 |  554661.933552 |  17.919712 |        30952.614 |
|              25% | 224804.981678 |  435824.798431 |  16.917271 |        25762.122 |
|              27% | 192178.341501 |  500625.782228 |  17.929862 |        27921.341 |
|              29% | 202388.180530 |  428706.164795 |  18.315442 |        23406.815 |
|              31% | 186018.825105 |  336620.998418 |  18.189721 |        18506.111 |
|              33% | 136733.438162 |  429424.142225 |  18.124567 |        23692.932 |
|              35% | 175527.900160 |  359298.649037 |  18.305922 |        19627.454 |
|              37% | 171588.393761 |  382877.708860 |  18.130678 |        21117.672 |
|              39% | 161707.632600 |  322976.551902 |  18.208744 |        17737.443 |
|              41% | 147972.773010 |  328062.463093 |  18.080970 |        18144.074 |
|              43% | 148878.202742 |  304330.624791 |  18.072859 |        16839.097 |
|              45% | 153043.265331 |  290132.590594 |  18.320154 |        15836.799 |
|              47% | 138780.948151 |  275398.639531 |  18.318714 |        15033.732 |
|              49% | 141683.196373 |  262418.978140 |  18.347321 |        14302.850 |
|              51% | 129631.069975 |  251004.016064 |  18.243687 |        13758.404 |
|              53% | 122699.386503 |  279368.626903 |  18.252270 |        15305.966 |
|              55% | 126415.857605 |  257692.109468 |  18.413838 |        13994.481 |
|              57% | 124094.112975 |  261383.240107 |  18.303868 |        14280.219 |
|              59% | 110224.416913 |  267809.319764 |  18.070570 |        14820.192 |
|              61% |  89039.266316 |  260274.329143 |  18.125954 |        14359.207 |
|              63% | 107943.567103 |  260878.639257 |  18.354427 |        14213.391 |
|              65% | 107136.352436 |  257281.053823 |  18.418714 |        13968.459 |
|              67% | 108150.198996 |  244075.077494 |  18.375599 |        13282.564 |
|              69% | 106537.117532 |  259289.029481 |  18.048618 |        14366.143 |
|              71% | 103178.943241 |  262818.996557 |  18.178904 |        14457.362 |
|              73% | 103287.645765 |  242571.255306 |  18.352467 |        13217.365 |
|              75% | 100584.395337 |  237079.184448 |  18.393077 |        12889.588 |
|              77% |  96127.041498 |  236456.929370 |  18.243537 |        12961.134 |
|              79% |  97712.549223 |  219293.436547 |  18.088276 |        12123.512 |
|              81% |  85571.015386 |  216136.771349 |  17.981039 |        12020.260 |
|              83% |  94715.805226 |  222350.691511 |  18.066351 |        12307.449 |
|              85% |  88968.763067 |  204156.628966 |  18.128852 |        11261.421 |
|              87% |  85845.015409 |  220288.578037 |  18.324132 |        12021.774 |
|              89% |  87802.479542 |  206953.642384 |  18.213346 |        11362.747 |
|              91% |  87971.637944 |  202085.522593 |  18.167054 |        11123.737 |
|              93% |  86649.105781 |  196463.654224 |  18.269641 |        10753.559 |
|              95% |  84836.350680 |  197655.802186 |  18.322395 |        10787.662 |
|              97% |  85931.323686 |  193311.424705 |  18.319306 |        10552.333 |
|              99% |  85578.338411 |  205803.663305 |  18.150254 |        11338.886 |
|------------------+---------------+----------------+------------+------------------|
#+TBLFM: $5=($3/$4)
